tutorials/incompressible/simpleDBSFoam/est_subvol/system/blockMeshDict2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale res;


vertices
(
    (xMin yMin zMin)
    (xMax yMin zMin)
    (xMax yMax zMin)
    (xMin yMax zMin)
    (xMin yMin zMax)
    (xMax yMin zMax)
    (xMax yMax zMax)
    (xMin yMax zMax)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (nx ny nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  walls 
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
   inletOutlet 
    {
        type cyclic;
        faces
        (           
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
