tutorials/incompressible/simpleDBSFoam/est_subvol/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .000800;

y1 0;
y2 .000800;

z1 0;
z2 .000800;

velocity volumeAveraged;
pressureDrop momentumSource;