tutorials/incompressible/simpleDBSFoam/est_subvol/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
{
name refinementRegion;
type cellSet;
action new;
source fieldToCell;
field eps;
min 0.0011;
max 0.349;
}
{
name refinementRegion;
type cellSet;
action new;
source fieldToCell;
field eps;
min 0.351;
max 1.0;
}
);